[
  {
    "inputs": "### Instruction: \n\n What is the purpose of THE INCOME-TAX ACT, 1961 ACT NO. 43 OF 1961 13th September, 1961?\n\n### Response: \n\n The purpose is to consolidate and amend the law relating to income-tax and super-tax."
  },
  {
    "inputs": "### Instruction: \n\n What are the details regarding the short title, extent, and commencement of the Income-tax Act, 1961?\n\n### Response: \n\n (1) This Act may be called the Income-tax Act, 1961.\n\n(2) It extends to the whole of India.\n\n(3) Save as otherwise provided in this Act, it shall come into force on the 1st day of April, 1962."
  },
  {
    "inputs": "### Instruction: \n\n What is meant by 'advance tax' in the Income-tax Act, 1961?\n\n### Response: \n\n 'Advance tax' refers to the tax payable as per Chapter XVII-C of the Act."
  },
  {
    "inputs": "### Instruction: \n\n What is the definition of 'agricultural income' in the Income-tax Act, 1961?\n\n### Response: \n\n 'Agricultural income' includes:\n(a) Rent or revenue from land used for agricultural purposes in India.\n(b) Income from such land through agriculture, processes to render produce marketable, or sale of produce without further processing.\n(c) Income from buildings on such land, subject to certain conditions."
  },
  {
    "inputs": "### Instruction: \n\n What are the conditions for income to be considered 'agricultural income' under the Income-tax Act, 1961?\n\n### Response: \n\n Conditions include the land's location in relation to municipalities or cantonment boards, population criteria, and the nature of activities carried out on the land."
  },
  {
    "inputs": "### Instruction: \n\n What are the exclusions from 'agricultural income' as per the Income-tax Act, 1961?\n\n### Response: \n\n Exclusions include income from the transfer of certain lands, income from non-agricultural use of buildings or land, income from nursery saplings or seedlings, and specific population definitions."
  },
  {
    "inputs": "### Instruction: \n\n What is the definition of 'amalgamation' in the Income-tax Act, 1961?\n\n### Response: \n\n 'Amalgamation' refers to the merger of companies, resulting in the formation of a new company or the merger of companies into an existing one, with specific conditions regarding property, liabilities, and shareholder rights."
  },
  {
    "inputs": "### Instruction: \n\n What does 'Additional Commissioner' mean in the Income-tax Act, 1961?\n\n### Response: \n\n 'Additional Commissioner' refers to a person appointed as an Additional Commissioner of Income-tax under section 117(1)."
  },
  {
    "inputs": "### Instruction: \n\n What does 'Additional Director' mean in the Income-tax Act, 1961?\n\n### Response: \n\n 'Additional Director' refers to a person appointed as an Additional Director of Income-tax under section 117(1)."
  },
  {
    "inputs": "### Instruction: \n\n What is the meaning of 'annual value' in the Income-tax Act, 1961?\n\n### Response: \n\n 'Annual value' of any property refers to its annual value as determined under section 23 of the Act."
  },
  {
    "inputs": "### Instruction: \n\n What is the definition of 'Appellate Tribunal' in the Income-tax Act, 1961?\n\n### Response: \n\n 'Appellate Tribunal' refers to the Tribunal constituted under section 252 of the Act."
  },
  {
    "inputs": "### Instruction: \n\n What does 'approved gratuity fund' mean in the Income-tax Act, 1961?\n\n### Response: \n\n 'Approved gratuity fund' refers to a gratuity fund approved by the tax authorities in accordance with the rules in Part C of the Fourth Schedule."
  },
  {
    "inputs": "### Instruction: \n\n What does 'approved superannuation fund' mean in the Income-tax Act, 1961?\n\n### Response: \n\n 'Approved superannuation fund' refers to a superannuation fund approved by the tax authorities in accordance with the rules in Part B of the Fourth Schedule."
  },
  {
    "inputs": "### Instruction: \n\n Who is considered an 'assesse' under the Income-tax Act, 1961?\n\n### Response: \n\n 'Assesse' includes persons liable to pay tax under the Act, those subject to assessment proceedings, deemed assessees, and those deemed in default under the Act."
  },
  {
    "inputs": "### Instruction: \n\n What is the role of an 'Assessing Officer' in the Income-tax Act, 1961?\n\n### Response: \n\n 'Assessing Officer' refers to officials with jurisdiction over tax assessments, including Assistant Commissioners, Deputy Commissioners, and other designated officers as per the Act."
  },
  {
    "inputs": "### Instruction: \n\n What does 'assessment' mean in the Income-tax Act, 1961?\n\n### Response: \n\n 'Assessment' includes reassessment."
  },
  {
    "inputs": "### Instruction: \n\n What is the definition of 'assessment year' in the Income-tax Act, 1961?\n\n### Response: \n\n 'Assessment year' refers to the twelve-month period starting from April 1st each year."
  },
  {
    "inputs": "### Instruction: \n\n Who is an 'Assistant Commissioner' in the Income-tax Act, 1961?\n\n### Response: \n\n 'Assistant Commissioner' refers to a person appointed as an Assistant Commissioner of Income-tax or a Deputy Commissioner of Income-tax under section 117(1)."
  },
  {
    "inputs": "### Instruction: \n\n What does 'Assistant Director' mean in the Income-tax Act, 1961?\n\n### Response: \n\n 'Assistant Director' refers to a person appointed as an Assistant Director of Income-tax under section 117(1)."
  },
  {
    "inputs": "### Instruction: \n\n What is the meaning of 'average rate of income-tax' in the Income-tax Act, 1961?\n\n### Response: \n\n 'Average rate of income-tax' is calculated by dividing the income-tax amount on total income by the total income itself."
  },
  {
    "inputs": "### Instruction: \n\n What is meant by 'block of assets' in the Income-tax Act, 1961?\n\n### Response: \n\n 'Block of assets' refers to a group of tangible or intangible assets with the same depreciation rate prescribed."
  },
  {
    "inputs": "### Instruction: \n\n What does 'Board' mean in the Income-tax Act, 1961?\n\n### Response: \n\n 'Board' refers to the Central Board of Direct Taxes established under the Central Boards of Revenue Act, 1963."
  },
  {
    "inputs": "### Instruction: \n\n What is included in the term 'books or books of account' in the Income-tax Act, 1961?\n\n### Response: \n\n 'Books or books of account' include various types of records such as ledgers, cash books, and electronic data storage records."
  },
  {
    "inputs": "### Instruction: \n\n What does 'business' encompass in the Income-tax Act, 1961?\n\n### Response: \n\n 'Business' includes trade, commerce, manufacture, or any similar venture."
  },
  {
    "inputs": "### Instruction: \n\n What is a 'business trust' according to the Income-tax Act, 1961?\n\n### Response: \n\n 'Business trust' refers to a trust registered as an Infrastructure Investment Trust or a Real Estate Investment Trust, with units listed on a recognized stock exchange."
  },
  {
    "inputs": "### Instruction: \n\n What is meant by 'capital asset' in the Income-tax Act, 1961?\n\n### Response: \n\n 'Capital asset' includes property held by an assessee, securities held by a Foreign Institutional Investor as per SEBI regulations, but excludes certain items like stock-in-trade, personal effects excluding specified items, and agricultural land under specified conditions."
  },
  {
    "inputs": "### Instruction: \n\n What are the exclusions from 'capital asset' as per the Income-tax Act, 1961?\n\n### Response: \n\n Exclusions from 'capital asset' include stock-in-trade (other than specified securities), personal effects excluding specified items like jewellery and art, and certain types of bonds issued by the Central Government."
  },
  {
    "inputs": "### Instruction: \n\n What is the meaning of 'Foreign Institutional Investor' and 'securities' in the Income-tax Act, 1961?\n\n### Response: \n\n 'Foreign Institutional Investor' and 'securities' have specific meanings as defined in relevant sections of the Act and SEBI regulations."
  },
  {
    "inputs": "### Instruction: \n\n What are the conditions for agricultural land to be excluded from 'capital asset' in the Income-tax Act, 1961?\n\n### Response: \n\n Agricultural land is excluded if it meets specific criteria related to population density and distance from municipalities or cantonment boards as per the Act."
  },
  {
    "inputs": "### Instruction: \n\n What are the specified bonds excluded from 'capital asset' in the Income-tax Act, 1961?\n\n### Response: \n\n Specified bonds like 6½ per cent.. Gold Bonds, 1977, or 7 per cent.. Gold Bonds, 1980, issued by the Central Government are excluded from 'capital asset'."
  },
  {
    "inputs": "### Instruction: \n\n What is included in the term 'property' as per the Income-tax Act, 1961?\n\n### Response: \n\n 'Property' includes rights in or in relation to an Indian company, including management or control rights."
  },
  {
    "inputs": "### Instruction: \n\n What does 'charitable purpose' include in the Income-tax Act, 1961?\n\n### Response: \n\n 'Charitable purpose' includes relief for the poor, education, yoga, medical relief, environmental preservation, preservation of monuments, and activities for general public utility, with certain conditions regarding trade or business activities."
  },
  {
    "inputs": "### Instruction: \n\n What is the definition of 'Chief Commissioner' in the Income-tax Act, 1961?\n\n### Response: \n\n 'Chief Commissioner' refers to a person appointed as a Chief Commissioner of Income-tax or a Principal Chief Commissioner of Income-tax under section 117(1)."
  },
  {
    "inputs": "### Instruction: \n\n What is the scope of 'child' in relation to an individual in the Income-tax Act, 1961?\n\n### Response: \n\n 'Child' includes step-child and adopted child of an individual."
  },
  {
    "inputs": "### Instruction: \n\n What is the meaning of 'Commissioner' in the Income-tax Act, 1961?\n\n### Response: \n\n 'Commissioner' refers to a person appointed as a Commissioner of Income-tax, Director of Income-tax, Principal Commissioner of Income-tax, or Principal Director of Income-tax under section 117(1)."
  },
  {
    "inputs": "### Instruction: \n\n What does 'Commissioner (Appeals)' signify in the Income-tax Act, 1961?\n\n### Response: \n\n 'Commissioner (Appeals)' refers to a person appointed as a Commissioner of Income-tax (Appeals) under section 117(1)."
  },
  {
    "inputs": "### Instruction: \n\n Define 'company' as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Company' includes: \n(i) Any Indian company, \n(ii) Any body corporate incorporated outside India, \n(iii) Any institution, association, or body assessed as a company under the Indian Income-tax Act, 1922 or this Act for any assessment year on or before April 1, 1970, \n(iv) Any institution, association, or body declared by the Board to be a company."
  },
  {
    "inputs": "### Instruction: \n\n When is an institution, association, or body deemed to be a company under the Income-tax Act, 1961?\n\n### Response: \n\n An institution, association, or body is deemed to be a company only for the assessment year(s) specified in the Board's declaration."
  },
  {
    "inputs": "### Instruction: \n\n Define 'company in which the public are substantially interested' as per the Income-tax Act, 1961.\n\n### Response: \n\n A company in which the public are substantially interested includes: \n(a) A company owned by the Government or the Reserve Bank of India, or in which at least 40% of shares are held by the Government, RBI, or a corporation owned by RBI; \n(aa) A company registered under section 25 of the Companies Act, 1956; \n(ab) A company with no share capital, declared by the Board to be a company in which the public are substantially interested; \n(ac) A mutual benefit finance company declared by the Central Government to be a Nidhi or Mutual Benefit Society under section 620A of the Companies Act, 1956; \n(ad) A company where at least 50% of voting power shares are held by one or more co-operative societies."
  },
  {
    "inputs": "### Instruction: \n\n Under what conditions is a company in which the public are substantially interested, according to the Income-tax Act, 1961?\n\n### Response: \n\n A company is considered to be in which the public are substantially interested if it is not a private company and meets either of the following conditions: \n(A) Shares are listed in a recognized stock exchange in India; \n(B) At least 50% of voting power shares are held by the Government, a corporation established by a Central, State, or Provincial Act, or another company to which this clause applies or its subsidiary with 100% share capital held by the parent company throughout the previous year."
  },
  {
    "inputs": "### Instruction: \n\n How does item (B) apply to an Indian company whose business involves ship construction, goods manufacture or processing, mining, or power generation/distribution?\n\n### Response: \n\n For Indian companies involved in ship construction, goods manufacture or processing, mining, or power generation/distribution, item (B) applies if at least 40% (instead of 50%) of voting power shares are held as specified."
  },
  {
    "inputs": "### Instruction: \n\n Define 'co-operative society' as per the Income-tax Act, 1961.\n\n### Response: \n\n A 'co-operative society' means a society registered under the Co-operative Societies Act, 1912, or any other law for the time being in force in any State for the registration of co-operative societies."
  },
  {
    "inputs": "### Instruction: \n\n Define 'Deputy Commissioner' as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Deputy Commissioner' means a person appointed to be a Deputy Commissioner of Income-tax under sub-section (1) of section 117."
  },
  {
    "inputs": "### Instruction: \n\n Explain 'demerger' in relation to companies as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Demerger' means the transfer, pursuant to a scheme of arrangement under sections 391 to 394 of the Companies Act, 1956, by a demerged company of one or more undertakings to any resulting company in such a manner that: \n(i) All the property of the undertaking being transferred becomes the property of the resulting company. \n(ii) All the liabilities relatable to the undertaking become the liabilities of the resulting company. \n(iii) The property and liabilities are transferred at values appearing in its books of account. \n(iv) The resulting company issues its shares to the shareholders of the demerged company on a proportionate basis. \n(v) Shareholders holding not less than three-fourths in value of the shares in the demerged company become shareholders of the resulting company. \n(vi) The transfer of the undertaking is on a going concern basis. \n(vii) The demerger is in accordance with conditions notified by the Central Government under sub-section (5) of section 72A."
  },
  {
    "inputs": "### Instruction: \n\n What does 'undertaking' include for the purpose of 'demerger' as per the Income-tax Act, 1961?\n\n### Response: \n\n For the purpose of 'demerger', 'undertaking' includes any part of an undertaking, a unit or division of an undertaking, or a business activity taken as a whole. It does not include individual assets or liabilities or any combination thereof not constituting a business activity."
  },
  {
    "inputs": "### Instruction: \n\n What are the liabilities included in 'demerger' as per the Income-tax Act, 1961?\n\n### Response: \n\n Liabilities in 'demerger' include: \n(a) Liabilities arising out of the activities or operations of the undertaking. \n(b) Specific loans or borrowings raised, incurred, and utilized solely for the activities or operations of the undertaking. \n(c) General or multipurpose borrowings of the demerged company proportional to the value of assets transferred."
  },
  {
    "inputs": "### Instruction: \n\n How is the value of the property determined in 'demerger' as per the Income-tax Act, 1961?\n\n### Response: \n\n For determining the value of the property in 'demerger', any change in the value of assets due to revaluation is ignored."
  },
  {
    "inputs": "### Instruction: \n\n When is the splitting up or reconstruction of an authority deemed to be a 'demerger' as per the Income-tax Act, 1961?\n\n### Response: \n\n The splitting up or reconstruction of an authority or a body established under a Central, State, or Provincial Act, or a local authority or public sector company into separate entities is deemed to be a 'demerger' if it fulfills conditions notified by the Central Government in the Official Gazette."
  },
  {
    "inputs": "### Instruction: \n\n When is the reconstruction or splitting up of a company, which ceased to be a public sector company, deemed to be a 'demerger' as per the Income-tax Act, 1961?\n\n### Response: \n\n The reconstruction or splitting up of a company, which ceased to be a public sector company due to the transfer of its shares by the Central Government, is deemed to be a 'demerger' if it is done to fulfill conditions attached to the transfer and other conditions notified by the Central Government in the Official Gazette."
  },
  {
    "inputs": "### Instruction: \n\n Define 'demerged company' as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Demerged company' means the company whose undertaking is transferred, pursuant to a demerger, to a resulting company."
  },
  {
    "inputs": "### Instruction: \n\n Define 'Deputy Commissioner (Appeals)' as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Deputy Commissioner (Appeals)' means a person appointed to be a Deputy Commissioner of Income-tax (Appeals) or an Additional Commissioner of Income-tax (Appeals) under sub-section (1) of section 117."
  },
  {
    "inputs": "### Instruction: \n\n Define 'Deputy Director' as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Deputy Director' means a person appointed to be a Deputy Director of Income-tax under sub-section (1) of section 117."
  },
  {
    "inputs": "### Instruction: \n\n Define 'director', 'manager', and 'managing agent' in relation to a company as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Director', 'manager', and 'managing agent' have the meanings assigned to them in the Companies Act, 1956."
  },
  {
    "inputs": "### Instruction: \n\n Define 'Director General or Director' as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Director General or Director' means a person appointed to be a Director General of Income-tax or a Principal Director General of Income-tax or, as the case may be, a Director of Income-tax or a Principal Director of Income-tax, under sub-section (1) of section 117. This includes an Additional Director of Income-tax, a Joint Director of Income-tax, an Assistant Director, or a Deputy Director of Income-tax."
  },
  {
    "inputs": "### Instruction: \n\n Explain the definition of 'dividend' as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Dividend' includes: \n(a) Any distribution by a company of accumulated profits, whether capitalized or not, if such distribution releases assets to shareholders. \n(b) Any distribution to shareholders of debentures, debenture-stock, or deposit certificates, whether with or without interest, and any distribution of bonus shares to preference shareholders, to the extent of accumulated profits. \n(c) Any distribution to shareholders on liquidation, attributable to accumulated profits immediately before liquidation. \n(d) Any distribution to shareholders on reduction of capital, to the extent of accumulated profits arising after the previous year ending before April 1, 1933. \n(e) Any payment by a non-public company to a shareholder holding at least 10% of voting power, or to a concern in which such shareholder has a substantial interest, to the extent of accumulated profits."
  },
  {
    "inputs": "### Instruction: \n\n What is excluded from the definition of 'dividend' as per the Income-tax Act, 1961?\n\n### Response: \n\n 'Dividend' does not include: \n(i) Distribution in sub-clause (c) or (d) for shares issued for full cash consideration, where the holder is not entitled to surplus assets on liquidation. \n(ia) Distribution in sub-clause (c) or (d) attributable to capitalized profits representing bonus shares allotted to equity shareholders after March 31, 1964, and before April 1, 1965. \n(ii) Advance or loan to a shareholder or concern by a company in the ordinary course of its business, where lending is a substantial part of the company's business. \n(iii) Dividend paid by a company set off against a sum previously treated as a dividend under sub-clause (e). \n(iv) Payment by a company on purchase of its own shares from a shareholder under section 77A of the Companies Act, 1956. \n(v) Distribution of shares pursuant to a demerger by the resulting company to shareholders of the demerged company."
  },
  {
    "inputs": "### Instruction: \n\n Explain the term 'accumulated profits' in the context of 'dividend' as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Accumulated profits' do not include capital gains arising before April 1, 1946, or after March 31, 1948, and before April 1, 1956. In sub-clauses (a), (b), (d), and (e), it includes all profits up to the date of distribution or payment. In sub-clause (c), it includes all profits up to the date of liquidation, excluding profits prior to three successive previous years immediately preceding the year of compulsory acquisition by the Government. In the case of an amalgamated company, accumulated profits or loss include those of the amalgamating company on the date of amalgamation."
  },
  {
    "inputs": "### Instruction: \n\n Define 'concern' and 'substantial interest' in a concern as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Concern' means a Hindu undivided family, firm, association of persons, body of individuals, or company. A person is deemed to have a substantial interest in a concern, other than a company, if they are beneficially entitled to not less than 20% of the income of the concern at any time during the previous year."
  },
  {
    "inputs": "### Instruction: \n\n Define 'domestic company' as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Domestic company' means an Indian company, or any other company which, in respect of its income liable to tax under this Act, has made the prescribed arrangements for the declaration and payment, within India, of the dividends (including dividends on preference shares) payable out of such income."
  },
  {
    "inputs": "### Instruction: \n\n Define 'document' as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Document' includes an electronic record as defined in clause (t) of sub-section (1) of section 2 of the Information Technology Act, 2000."
  },
  {
    "inputs": "### Instruction: \n\n Define 'electoral trust' as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Electoral trust' means a trust so approved by the Board in accordance with the scheme made in this regard by the Central Government."
  },
  {
    "inputs": "### Instruction: \n\n Define 'fair market value' in relation to a capital asset as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Fair market value', in relation to a capital asset, means: \n(i) The price that the capital asset would ordinarily fetch on sale in the open market on the relevant date; and \n(ii) Where the price referred to in sub-clause (i) is not ascertainable, such price as may be determined in accordance with the rules made under this Act."
  },
  {
    "inputs": "### Instruction: \n\n Define 'firm' as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Firm' shall have the meaning assigned to it in the Indian Partnership Act, 1932, and shall include a limited liability partnership as defined in the Limited Liability Partnership Act, 2008."
  },
  {
    "inputs": "### Instruction: \n\n Define 'partner' as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Partner' shall have the meaning assigned to it in the Indian Partnership Act, 1932, and shall include: \n(a) Any person who, being a minor, has been admitted to the benefits of partnership; and \n(b) A partner of a limited liability partnership as defined in the Limited Liability Partnership Act, 2008."
  },
  {
    "inputs": "### Instruction: \n\n Define 'partnership' as per the Income-tax Act, 1961.\n\n### Response: \n\n 'Partnership' shall have the meaning assigned to it in the Indian Partnership Act, 1932, and shall include a limited liability partnership as defined in the Limited Liability Partnership Act, 2008."
  }
]
